## Terraform Plan
<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.network.google_compute_firewall.allow_google_frontend has changed
  ~ resource "google_compute_firewall" "allow_google_frontend" {
        id                      = "projects/kotofurumiya-dotdev/global/firewalls/allow-load-balancer"
        name                    = "allow-load-balancer"
+       source_service_accounts = []
+       source_tags             = []
+       target_service_accounts = []
+       target_tags             = []
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.google_compute_firewall.allow_iap has changed
  ~ resource "google_compute_firewall" "allow_iap" {
        id                      = "projects/kotofurumiya-dotdev/global/firewalls/allow-iap"
        name                    = "allow-iap"
+       source_service_accounts = []
+       source_tags             = []
+       target_service_accounts = []
+       target_tags             = []
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.google_dns_managed_zone.app_dns_zone has changed
  ~ resource "google_dns_managed_zone" "app_dns_zone" {
        id            = "projects/kotofurumiya-dotdev/managedZones/app-dns-zone"
+       labels        = {}
        name          = "app-dns-zone"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.store.google_artifact_registry_repository.server will be created
+   resource "google_artifact_registry_repository" "server" {
+       create_time   = (known after apply)
+       format        = "DOCKER"
+       id            = (known after apply)
+       location      = "asia-northeast1"
+       name          = (known after apply)
+       project       = (known after apply)
+       repository_id = "server"
+       update_time   = (known after apply)
    }

  # module.store.google_project_service.artifactregistry will be created
+   resource "google_project_service" "artifactregistry" {
+       disable_on_destroy = true
+       id                 = (known after apply)
+       project            = (known after apply)
+       service            = "artifactregistry.googleapis.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>